heroku_app/app/controllers/charts_controller.rb

  def ac
    @data = Datum.new
    @data.year = params[:year]
    @data.month = params[:month]
    @data.day = params[:day]
    @data.time = params[:time]
    @data.about = params[:about]
    puts ("Hello Post")
    # val = params[:month]
    # puts (val)
    # puts val.is_a?(Integer)
    # puts val.is_a?(String)
    @data.save
---
INSERT INTO "data" ("year", "month", "day", "time", "about", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["year", 2016], ["month", "7"], ["day", 5], ["time", 16], ["about", "12.7"], ["created_at", "2016-07-05 07:29:29.737633"], ["updated_at", "2016-07-05 07:29:29.737633"]]