heroku_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "ryooopan"]]
---
  def show
    @user = User.find_by(:username => params[:username])